draft/blog.org
#+hugo_base_dir: ../
#+hugo_selection: ./
#+hugo_auto_set_lastmod: t
#+options: author:nil
** DONE CKA(Certified kubernetes Administrator)に合格した        :kubernetes:
   CLOSED: [2020-07-07 Tue 09:40]
:PROPERTIES:
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :archives '(\"2020\" \"2020-07\")
:EXPORT_FILE_NAME: 202007070839

:END:
Kubernetesの管理者向け資格であるCertified Kubernets Administratorを受験して
無事に合格したので、合格体験記はすでに巷にいくらでもあるが、せっかくなのでメモ。
*** CKAとは
Linux Foundationが管理している、kubernetesの認定試験。
Kubernetesの操作やkubernetes自体の管理について問われる。
よくある4択問題のようなテストではなく、実際にkubernetesクラスタを操作する実技試験。

試験時間は3時間で、24問。問題によって得点は異なり、74%以上で合格。

*** バックグラウンド
kubernetes歴は15ヶ月ぐらい。うち、ほとんどはOpenShiftだったので、
純粋にkubernetesを触っているのは、半年ぐらいか。
自宅で、kubeadmを使って仮想マシンだったりラズパイおうちクラスタだったり作ってたので、
k8sのインストールは慣れてた。
*** 試験に役立ったもの
**** Udemyのコース
 他の人の結果を見て、以下のUdemyのコースがよさそうだったので、こちらでやった。
 これ書いてる今もそうだけど、しょっちゅうセールしてて、元の価格はなんなんだ。。。ってなりがち。

 [[https://px.a8.net/svt/ejp?a8mat=3BHUM0+C673K2+3L4M+BW8O2&a8ejpredirect=https%3A%2F%2Fwww.udemy.com%2Fcourse%2Fcertified-kubernetes-administrator-with-practice-tests%2F][Certified Kubernetes Administrator (CKA) with Practice Tests]]

 動画と演習がセットになってて、最初はマジメに動画を見てたけど、途中で飽きてしまったので演習だけやったようなもん。

**** Ergodox EZ
試験問題では、 abcってPodを作ってください、みたいな問題が出てくる。当然、確実に作成するためにコピペしたいのだけど、
試験はブラウザ上のアプリ(katacodaとかCloudShell的な)でおこなう。
ブラウザなので、コピペは =Ctrl-C/Ctrl-V= ではできない。Windowsの場合は、 =Ctrl-Insert/Shift-Insert= でおこなう。
正直、Insertキーなんて普通のキーボードでは使い勝手の良いところにないと思う。
自分は、 [[ergodox ezを購入した]] の通り、Ergodox EZを使っていたので、Insertキーを =Lower-I= にバインドしていたので
手をホームポジションから移すことなく、スムーズにペーストすることができて、自作キーボード万歳!って思った。

そうは言っても、そもそもペーストが、 =Shift-Insert= ってことに慣れてないので一週間ぐらいは、普段から意識して
ペーストをこちらのキーバインドでおこなうようにしていた。
今回初めて知ったのだけど、これ、別に特殊なキーバインドじゃなくて、他のWindowsアプリでもこれでペーストできるのね。

*** 試験
体験記を見ると、貸し会議室で受験した人が多かったけど
- 貸し会議室のWifiの品質やポートブロックが心配だった
- ノートPCの小さいディスプレイで頑張れる自信がなかった
- そもそも、最近ノートPCの調子が悪くトラブルが怖かった
などの理由により、自宅で受けることにした。

机の横に本棚があるので心配だったが、受験サイトでチャットができ、問題ないか聞いてみたところ
「大丈夫だけど、もしかしたら布でかくせって言われるかもね〜」とのことだったので、
事前に布をかけておいた。当日はなにも言われなかったので多分それでよいのでしょう。

ちなみに、数々の合格体験記ではGoogle翻訳プラグインはOKだったって書かれてたけど
自分の場合はダメって言われてしまった。

*** 結果
93%だった。一応全問問いたものの、7%の問題だけ挙動が怪しかったので、たぶんそれのやりかたが間違ってたのだと思う。
部屋の綺麗さを保ててるうちに、CKADも取ってしまいたいので、さっそく今日から勉強再開だ。
