content/posts/202007070839.md
+++
title = "CKA(Certified kubernetes Administrator)に合格した"
date = 2020-07-07T09:40:00+09:00
lastmod = 2020-07-11T10:36:03+09:00
tags = ["kubernetes"]
draft = false
archives = ["2020", "2020-07"]
+++

Kubernetes の管理者向け資格である Certified Kubernets Administrator を受験して
無事に合格したので、合格体験記はすでに巷にいくらでもあるが、せっかくなのでメモ。

## CKA とは {#cka とは}

Linux Foundation が管理している、kubernetes の認定試験。
Kubernetes の操作や kubernetes 自体の管理について問われる。
よくある 4 択問題のようなテストではなく、実際に kubernetes クラスタを操作する実技試験。

試験時間は 3 時間で、24 問。問題によって得点は異なり、74%以上で合格。

## バックグラウンド {#バックグラウンド}

kubernetes 歴は 15 ヶ月ぐらい。うち、ほとんどは OpenShift だったので、
純粋に kubernetes を触っているのは、半年ぐらいか。
自宅で、kubeadm を使って仮想マシンだったりラズパイおうちクラスタだったり作ってたので、
k8s のインストールは慣れてた。

## 試験に役立ったもの {#試験に役立ったもの}

### Udemy のコース {#udemy のコース}

他の人の結果を見て、以下の Udemy のコースがよさそうだったので、こちらでやった。
これ書いてる今もそうだけど、しょっちゅうセールしてて、元の価格はなんなんだ。。。ってなりがち。

[Certified Kubernetes Administrator (CKA) with Practice Tests](https://px.a8.net/svt/ejp?a8mat=3BHUM0+C673K2+3L4M+BW8O2&a8ejpredirect=https%3A%2F%2Fwww.udemy.com%2Fcourse%2Fcertified-kubernetes-administrator-with-practice-tests%2F)

動画と演習がセットになってて、最初はマジメに動画を見てたけど、途中で飽きてしまったので演習だけやったようなもん。

### Ergodox EZ {#ergodox-ez}

試験問題では、 abc って Pod を作ってください、みたいな問題が出てくる。当然、確実に作成するためにコピペしたいのだけど、
試験はブラウザ上のアプリ(katacoda とか CloudShell 的な)でおこなう。
ブラウザなので、コピペは `Ctrl-C/Ctrl-V` ではできない。Windows の場合は、 `Ctrl-Insert/Shift-Insert` でおこなう。
正直、Insert キーなんて普通のキーボードでは使い勝手の良いところにないと思う。
自分は、 [ergodox ez を購入した]({{< relref "202005182209" >}}) の通り、Ergodox EZ を使っていたので、Insert キーを `Lower-I` にバインドしていたので
手をホームポジションから移すことなく、スムーズにペーストすることができて、自作キーボード万歳!って思った。

そうは言っても、そもそもペーストが、 `Shift-Insert` ってことに慣れてないので一週間ぐらいは、普段から意識して
ペーストをこちらのキーバインドでおこなうようにしていた。
今回初めて知ったのだけど、これ、別に特殊なキーバインドじゃなくて、他の Windows アプリでもこれでペーストできるのね。

## 試験 {#試験}

体験記を見ると、貸し会議室で受験した人が多かったけど

- 貸し会議室の Wifi の品質やポートブロックが心配だった
- ノート PC の小さいディスプレイで頑張れる自信がなかった
- そもそも、最近ノート PC の調子が悪くトラブルが怖かった

などの理由により、自宅で受けることにした。

机の横に本棚があるので心配だったが、受験サイトでチャットができ、問題ないか聞いてみたところ
「大丈夫だけど、もしかしたら布でかくせって言われるかもね〜」とのことだったので、
事前に布をかけておいた。当日はなにも言われなかったので多分それでよいのでしょう。

ちなみに、数々の合格体験記では Google 翻訳プラグインは OK だったって書かれてたけど
自分の場合はダメって言われてしまった。

## 結果 {#結果}

93%だった。一応全問問いたものの、7%の問題だけ挙動が怪しかったので、たぶんそれのやりかたが間違ってたのだと思う。
部屋の綺麗さを保ててるうちに、CKAD も取ってしまいたいので、さっそく今日から勉強再開だ。
